{"class_name": "Model", "keras_version": "2.3.1", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, null, 257], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "sigmoid", "dtype": "float32", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.3, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.3, "stateful": false, "recurrent_regularizer": null, "name": "lstm_1", "bias_constraint": null, "go_backwards": false, "implementation": 2, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": {"class_name": "MaxNorm", "config": {"max_value": 1e-05, "axis": 0}}}}, "trainable": true, "name": "bidirectional_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "bidirectional_1"}, {"class_name": "TimeDistributed", "config": {"dtype": "float32", "layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_1"}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "name": "time_distributed_1"}, {"class_name": "ELU", "config": {"dtype": "float32", "trainable": true, "name": "elu_1", "alpha": 1.0}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "name": "elu_1"}, {"class_name": "Dropout", "config": {"name": "dropout_1", "dtype": "float32", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}, "inbound_nodes": [[["elu_1", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "TimeDistributed", "config": {"dtype": "float32", "layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "Frame_score"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "Frame_score"}, {"class_name": "GlobalAveragePooling1D", "config": {"dtype": "float32", "trainable": true, "name": "Average_score", "data_format": "channels_last"}, "inbound_nodes": [[["Frame_score", 0, 0, {}]]], "name": "Average_score"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["Average_score", 0, 0], ["Frame_score", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}